Paciente8159/uCNC/uCNC/src/hal/mcus/esp32s3/mcumap_esp32s3.h
#define DOUT29 76
#if (DOUT29_BIT < 32)
#define DOUT29_MUXREG __io_mux__(DOUT29_BIT)
#define DOUT29_OUT_CONFREG __io_out_conf__(DOUT29_BIT)
#define DOUT29_IN_CONFREG __io_in_conf__(DOUT29_BIT)
#define DOUT29_OUTREG OUT0
#define DOUT29_INREG IN0
#else
#define DOUT29_OUTREG OUT1
#define DOUT29_INREG IN1
#endif
#define DIO76 76
#define DIO76_BIT DOUT29_BIT
#define DIO76_MUXREG DOUT29_MUXREG
#define DIO76_OUT_CONFREG DOUT29_OUT_CONFREG
#define DIO76_IN_CONFREG DOUT29_IN_CONFREG
#define DIO76_OUTREG DOUT29_OUTREG
#define DIO76_INREG DOUT29_INREG
#endif
#if (defined(DOUT30_BIT))
#define DOUT30 77
#if (DOUT30_BIT < 32)
#define DOUT30_MUXREG __io_mux__(DOUT30_BIT)
#define DOUT30_OUT_CONFREG __io_out_conf__(DOUT30_BIT)
#define DOUT30_IN_CONFREG __io_in_conf__(DOUT30_BIT)
#define DOUT30_OUTREG OUT0
#define DOUT30_INREG IN0
#else
#define DOUT30_OUTREG OUT1
#define DOUT30_INREG IN1
#endif
#define DIO77 77
#define DIO77_BIT DOUT30_BIT
#define DIO77_MUXREG DOUT30_MUXREG
#define DIO77_OUT_CONFREG DOUT30_OUT_CONFREG
#define DIO77_IN_CONFREG DOUT30_IN_CONFREG
#define DIO77_OUTREG DOUT30_OUTREG
#define DIO77_INREG DOUT30_INREG
#endif
#if (defined(DOUT31_BIT))
#define DOUT31 78
#if (DOUT31_BIT < 32)
#define DOUT31_MUXREG __io_mux__(DOUT31_BIT)
#define DOUT31_OUT_CONFREG __io_out_conf__(DOUT31_BIT)
#define DOUT31_IN_CONFREG __io_in_conf__(DOUT31_BIT)
#define DOUT31_OUTREG OUT0
#define DOUT31_INREG IN0
#else
#define DOUT31_OUTREG OUT1
#define DOUT31_INREG IN1
#endif
#define DIO78 78
#define DIO78_BIT DOUT31_BIT
#define DIO78_MUXREG DOUT31_MUXREG
#define DIO78_OUT_CONFREG DOUT31_OUT_CONFREG
#define DIO78_IN_CONFREG DOUT31_IN_CONFREG
#define DIO78_OUTREG DOUT31_OUTREG
#define DIO78_INREG DOUT31_INREG
#endif
#if (defined(DOUT32_BIT))
#define DOUT32 79
#if (DOUT32_BIT < 32)
#define DOUT32_MUXREG __io_mux__(DOUT32_BIT)
#define DOUT32_OUT_CONFREG __io_out_conf__(DOUT32_BIT)
#define DOUT32_IN_CONFREG __io_in_conf__(DOUT32_BIT)
#define DOUT32_OUTREG OUT0
#define DOUT32_INREG IN0
#else
#define DOUT32_OUTREG OUT1
#define DOUT32_INREG IN1
#endif
#define DIO79 79
#define DIO79_BIT DOUT32_BIT
#define DIO79_MUXREG DOUT32_MUXREG
#define DIO79_OUT_CONFREG DOUT32_OUT_CONFREG
#define DIO79_IN_CONFREG DOUT32_IN_CONFREG
#define DIO79_OUTREG DOUT32_OUTREG
#define DIO79_INREG DOUT32_INREG
#endif
#if (defined(DOUT33_BIT))
#define DOUT33 80
#if (DOUT33_BIT < 32)
#define DOUT33_MUXREG __io_mux__(DOUT33_BIT)
#define DOUT33_OUT_CONFREG __io_out_conf__(DOUT33_BIT)
#define DOUT33_IN_CONFREG __io_in_conf__(DOUT33_BIT)
#define DOUT33_OUTREG OUT0
#define DOUT33_INREG IN0
#else
#define DOUT33_OUTREG OUT1
#define DOUT33_INREG IN1
#endif
#define DIO80 80
#define DIO80_BIT DOUT33_BIT
#define DIO80_MUXREG DOUT33_MUXREG
#define DIO80_OUT_CONFREG DOUT33_OUT_CONFREG
#define DIO80_IN_CONFREG DOUT33_IN_CONFREG
#define DIO80_OUTREG DOUT33_OUTREG
#define DIO80_INREG DOUT33_INREG
#endif
#if (defined(DOUT34_BIT))
#define DOUT34 81
#if (DOUT34_BIT < 32)
#define DOUT34_MUXREG __io_mux__(DOUT34_BIT)
#define DOUT34_OUT_CONFREG __io_out_conf__(DOUT34_BIT)
#define DOUT34_IN_CONFREG __io_in_conf__(DOUT34_BIT)
#define DOUT34_OUTREG OUT0
#define DOUT34_INREG IN0
#else
#define DOUT34_OUTREG OUT1
#define DOUT34_INREG IN1
#endif
#define DIO81 81
#define DIO81_BIT DOUT34_BIT
#define DIO81_MUXREG DOUT34_MUXREG
#define DIO81_OUT_CONFREG DOUT34_OUT_CONFREG
#define DIO81_IN_CONFREG DOUT34_IN_CONFREG
#define DIO81_OUTREG DOUT34_OUTREG
#define DIO81_INREG DOUT34_INREG
#endif
#if (defined(DOUT35_BIT))
#define DOUT35 82
#if (DOUT35_BIT < 32)
#define DOUT35_MUXREG __io_mux__(DOUT35_BIT)
#define DOUT35_OUT_CONFREG __io_out_conf__(DOUT35_BIT)
#define DOUT35_IN_CONFREG __io_in_conf__(DOUT35_BIT)
#define DOUT35_OUTREG OUT0
#define DOUT35_INREG IN0
#else
#define DOUT35_OUTREG OUT1
#define DOUT35_INREG IN1
#endif
#define DIO82 82
#define DIO82_BIT DOUT35_BIT
#define DIO82_MUXREG DOUT35_MUXREG
#define DIO82_OUT_CONFREG DOUT35_OUT_CONFREG
#define DIO82_IN_CONFREG DOUT35_IN_CONFREG
#define DIO82_OUTREG DOUT35_OUTREG
#define DIO82_INREG DOUT35_INREG
#endif
#if (defined(DOUT36_BIT))
#define DOUT36 83
#if (DOUT36_BIT < 32)
#define DOUT36_MUXREG __io_mux__(DOUT36_BIT)
#define DOUT36_OUT_CONFREG __io_out_conf__(DOUT36_BIT)
#define DOUT36_IN_CONFREG __io_in_conf__(DOUT36_BIT)
#define DOUT36_OUTREG OUT0
#define DOUT36_INREG IN0
#else
#define DOUT36_OUTREG OUT1
#define DOUT36_INREG IN1
#endif
#define DIO83 83
#define DIO83_BIT DOUT36_BIT
#define DIO83_MUXREG DOUT36_MUXREG
#define DIO83_OUT_CONFREG DOUT36_OUT_CONFREG
#define DIO83_IN_CONFREG DOUT36_IN_CONFREG
#define DIO83_OUTREG DOUT36_OUTREG
#define DIO83_INREG DOUT36_INREG
#endif
#if (defined(DOUT37_BIT))
#define DOUT37 84
#if (DOUT37_BIT < 32)
#define DOUT37_MUXREG __io_mux__(DOUT37_BIT)
#define DOUT37_OUT_CONFREG __io_out_conf__(DOUT37_BIT)
#define DOUT37_IN_CONFREG __io_in_conf__(DOUT37_BIT)
#define DOUT37_OUTREG OUT0
#define DOUT37_INREG IN0
#else
#define DOUT37_OUTREG OUT1
#define DOUT37_INREG IN1
#endif
#define DIO84 84
#define DIO84_BIT DOUT37_BIT
#define DIO84_MUXREG DOUT37_MUXREG
#define DIO84_OUT_CONFREG DOUT37_OUT_CONFREG
#define DIO84_IN_CONFREG DOUT37_IN_CONFREG
#define DIO84_OUTREG DOUT37_OUTREG
#define DIO84_INREG DOUT37_INREG
#endif
#if (defined(DOUT38_BIT))
#define DOUT38 85
#if (DOUT38_BIT < 32)
#define DOUT38_MUXREG __io_mux__(DOUT38_BIT)
#define DOUT38_OUT_CONFREG __io_out_conf__(DOUT38_BIT)
#define DOUT38_IN_CONFREG __io_in_conf__(DOUT38_BIT)
#define DOUT38_OUTREG OUT0
#define DOUT38_INREG IN0
#else
#define DOUT38_OUTREG OUT1
#define DOUT38_INREG IN1
#endif
#define DIO85 85
#define DIO85_BIT DOUT38_BIT
#define DIO85_MUXREG DOUT38_MUXREG
#define DIO85_OUT_CONFREG DOUT38_OUT_CONFREG
#define DIO85_IN_CONFREG DOUT38_IN_CONFREG
#define DIO85_OUTREG DOUT38_OUTREG
#define DIO85_INREG DOUT38_INREG
#endif
#if (defined(DOUT39_BIT))
#define DOUT39 86
#if (DOUT39_BIT < 32)
#define DOUT39_MUXREG __io_mux__(DOUT39_BIT)
#define DOUT39_OUT_CONFREG __io_out_conf__(DOUT39_BIT)
#define DOUT39_IN_CONFREG __io_in_conf__(DOUT39_BIT)
#define DOUT39_OUTREG OUT0
#define DOUT39_INREG IN0
#else
#define DOUT39_OUTREG OUT1
#define DOUT39_INREG IN1
#endif
#define DIO86 86
#define DIO86_BIT DOUT39_BIT
#define DIO86_MUXREG DOUT39_MUXREG
#define DIO86_OUT_CONFREG DOUT39_OUT_CONFREG
#define DIO86_IN_CONFREG DOUT39_IN_CONFREG
#define DIO86_OUTREG DOUT39_OUTREG
#define DIO86_INREG DOUT39_INREG
#endif
#if (defined(DOUT40_BIT))
#define DOUT40 87
#if (DOUT40_BIT < 32)
#define DOUT40_MUXREG __io_mux__(DOUT40_BIT)
#define DOUT40_OUT_CONFREG __io_out_conf__(DOUT40_BIT)
#define DOUT40_IN_CONFREG __io_in_conf__(DOUT40_BIT)
#define DOUT40_OUTREG OUT0
#define DOUT40_INREG IN0
#else
#define DOUT40_OUTREG OUT1
#define DOUT40_INREG IN1
#endif
#define DIO87 87
#define DIO87_BIT DOUT40_BIT
#define DIO87_MUXREG DOUT40_MUXREG
#define DIO87_OUT_CONFREG DOUT40_OUT_CONFREG
#define DIO87_IN_CONFREG DOUT40_IN_CONFREG
#define DIO87_OUTREG DOUT40_OUTREG
#define DIO87_INREG DOUT40_INREG
#endif
#if (defined(DOUT41_BIT))
#define DOUT41 88
#if (DOUT41_BIT < 32)
#define DOUT41_MUXREG __io_mux__(DOUT41_BIT)
#define DOUT41_OUT_CONFREG __io_out_conf__(DOUT41_BIT)
#define DOUT41_IN_CONFREG __io_in_conf__(DOUT41_BIT)
#define DOUT41_OUTREG OUT0
#define DOUT41_INREG IN0
#else
#define DOUT41_OUTREG OUT1
#define DOUT41_INREG IN1
#endif
#define DIO88 88
#define DIO88_BIT DOUT41_BIT
#define DIO88_MUXREG DOUT41_MUXREG
#define DIO88_OUT_CONFREG DOUT41_OUT_CONFREG
#define DIO88_IN_CONFREG DOUT41_IN_CONFREG
#define DIO88_OUTREG DOUT41_OUTREG
#define DIO88_INREG DOUT41_INREG
#endif
#if (defined(DOUT42_BIT))
#define DOUT42 89
#if (DOUT42_BIT < 32)
#define DOUT42_MUXREG __io_mux__(DOUT42_BIT)
#define DOUT42_OUT_CONFREG __io_out_conf__(DOUT42_BIT)
#define DOUT42_IN_CONFREG __io_in_conf__(DOUT42_BIT)
#define DOUT42_OUTREG OUT0
#define DOUT42_INREG IN0
#else
#define DOUT42_OUTREG OUT1
#define DOUT42_INREG IN1
#endif
#define DIO89 89
#define DIO89_BIT DOUT42_BIT
#define DIO89_MUXREG DOUT42_MUXREG
#define DIO89_OUT_CONFREG DOUT42_OUT_CONFREG
#define DIO89_IN_CONFREG DOUT42_IN_CONFREG
#define DIO89_OUTREG DOUT42_OUTREG
#define DIO89_INREG DOUT42_INREG
#endif
#if (defined(DOUT43_BIT))
#define DOUT43 90
#if (DOUT43_BIT < 32)
#define DOUT43_MUXREG __io_mux__(DOUT43_BIT)
#define DOUT43_OUT_CONFREG __io_out_conf__(DOUT43_BIT)
#define DOUT43_IN_CONFREG __io_in_conf__(DOUT43_BIT)
#define DOUT43_OUTREG OUT0
#define DOUT43_INREG IN0
#else
#define DOUT43_OUTREG OUT1
#define DOUT43_INREG IN1
#endif
#define DIO90 90
#define DIO90_BIT DOUT43_BIT
#define DIO90_MUXREG DOUT43_MUXREG
#define DIO90_OUT_CONFREG DOUT43_OUT_CONFREG
#define DIO90_IN_CONFREG DOUT43_IN_CONFREG
#define DIO90_OUTREG DOUT43_OUTREG
#define DIO90_INREG DOUT43_INREG
#endif
#if (defined(DOUT44_BIT))
#define DOUT44 91
#if (DOUT44_BIT < 32)
#define DOUT44_MUXREG __io_mux__(DOUT44_BIT)
#define DOUT44_OUT_CONFREG __io_out_conf__(DOUT44_BIT)
#define DOUT44_IN_CONFREG __io_in_conf__(DOUT44_BIT)
#define DOUT44_OUTREG OUT0
#define DOUT44_INREG IN0
#else
#define DOUT44_OUTREG OUT1
#define DOUT44_INREG IN1
#endif
#define DIO91 91
#define DIO91_BIT DOUT44_BIT
#define DIO91_MUXREG DOUT44_MUXREG
#define DIO91_OUT_CONFREG DOUT44_OUT_CONFREG
#define DIO91_IN_CONFREG DOUT44_IN_CONFREG
#define DIO91_OUTREG DOUT44_OUTREG
#define DIO91_INREG DOUT44_INREG
#endif
#if (defined(DOUT45_BIT))
#define DOUT45 92
#if (DOUT45_BIT < 32)
#define DOUT45_MUXREG __io_mux__(DOUT45_BIT)
#define DOUT45_OUT_CONFREG __io_out_conf__(DOUT45_BIT)
#define DOUT45_IN_CONFREG __io_in_conf__(DOUT45_BIT)
#define DOUT45_OUTREG OUT0
#define DOUT45_INREG IN0
#else
#define DOUT45_OUTREG OUT1
#define DOUT45_INREG IN1
#endif
#define DIO92 92
#define DIO92_BIT DOUT45_BIT
#define DIO92_MUXREG DOUT45_MUXREG
#define DIO92_OUT_CONFREG DOUT45_OUT_CONFREG
#define DIO92_IN_CONFREG DOUT45_IN_CONFREG
#define DIO92_OUTREG DOUT45_OUTREG
#define DIO92_INREG DOUT45_INREG
#endif
#if (defined(DOUT46_BIT))
#define DOUT46 93
#if (DOUT46_BIT < 32)
#define DOUT46_MUXREG __io_mux__(DOUT46_BIT)
#define DOUT46_OUT_CONFREG __io_out_conf__(DOUT46_BIT)
#define DOUT46_IN_CONFREG __io_in_conf__(DOUT46_BIT)
#define DOUT46_OUTREG OUT0
#define DOUT46_INREG IN0
#else
#define DOUT46_OUTREG OUT1
#define DOUT46_INREG IN1
#endif
#define DIO93 93
#define DIO93_BIT DOUT46_BIT
#define DIO93_MUXREG DOUT46_MUXREG
#define DIO93_OUT_CONFREG DOUT46_OUT_CONFREG
#define DIO93_IN_CONFREG DOUT46_IN_CONFREG
#define DIO93_OUTREG DOUT46_OUTREG
#define DIO93_INREG DOUT46_INREG
#endif
#if (defined(DOUT47_BIT))
#define DOUT47 94
#if (DOUT47_BIT < 32)
#define DOUT47_MUXREG __io_mux__(DOUT47_BIT)
#define DOUT47_OUT_CONFREG __io_out_conf__(DOUT47_BIT)
#define DOUT47_IN_CONFREG __io_in_conf__(DOUT47_BIT)
#define DOUT47_OUTREG OUT0
#define DOUT47_INREG IN0
#else
#define DOUT47_OUTREG OUT1
#define DOUT47_INREG IN1
#endif
#define DIO94 94
#define DIO94_BIT DOUT47_BIT
#define DIO94_MUXREG DOUT47_MUXREG
#define DIO94_OUT_CONFREG DOUT47_OUT_CONFREG
#define DIO94_IN_CONFREG DOUT47_IN_CONFREG
#define DIO94_OUTREG DOUT47_OUTREG
#define DIO94_INREG DOUT47_INREG
#endif
#if (defined(DOUT48_BIT))
#define DOUT48 95
#if (DOUT48_BIT < 32)
#define DOUT48_MUXREG __io_mux__(DOUT48_BIT)
#define DOUT48_OUT_CONFREG __io_out_conf__(DOUT48_BIT)
#define DOUT48_IN_CONFREG __io_in_conf__(DOUT48_BIT)
#define DOUT48_OUTREG OUT0
#define DOUT48_INREG IN0
#else
#define DOUT48_OUTREG OUT1
#define DOUT48_INREG IN1
#endif
#define DIO95 95
#define DIO95_BIT DOUT48_BIT
#define DIO95_MUXREG DOUT48_MUXREG
#define DIO95_OUT_CONFREG DOUT48_OUT_CONFREG
#define DIO95_IN_CONFREG DOUT48_IN_CONFREG
#define DIO95_OUTREG DOUT48_OUTREG
#define DIO95_INREG DOUT48_INREG
#endif
#if (defined(DOUT49_BIT))
#define DOUT49 96
#if (DOUT49_BIT < 32)
#define DOUT49_MUXREG __io_mux__(DOUT49_BIT)
#define DOUT49_OUT_CONFREG __io_out_conf__(DOUT49_BIT)
#define DOUT49_IN_CONFREG __io_in_conf__(DOUT49_BIT)
#define DOUT49_OUTREG OUT0
#define DOUT49_INREG IN0
#else
#define DOUT49_OUTREG OUT1
#define DOUT49_INREG IN1
#endif
#define DIO96 96
#define DIO96_BIT DOUT49_BIT
#define DIO96_MUXREG DOUT49_MUXREG
#define DIO96_OUT_CONFREG DOUT49_OUT_CONFREG
#define DIO96_IN_CONFREG DOUT49_IN_CONFREG
#define DIO96_OUTREG DOUT49_OUTREG
#define DIO96_INREG DOUT49_INREG
#endif
#if (defined(LIMIT_X_BIT))
#define LIMIT_X 100
#if (LIMIT_X_BIT < 32)
#define LIMIT_X_MUXREG __io_mux__(LIMIT_X_BIT)
#define LIMIT_X_OUT_CONFREG __io_out_conf__(LIMIT_X_BIT)
#define LIMIT_X_IN_CONFREG __io_in_conf__(LIMIT_X_BIT)
#define LIMIT_X_OUTREG OUT0
#define LIMIT_X_INREG IN0
#else
#define LIMIT_X_OUTREG OUT1
#define LIMIT_X_INREG IN1
#endif
#define DIO100 100
#define DIO100_BIT LIMIT_X_BIT
#define DIO100_MUXREG LIMIT_X_MUXREG
#define DIO100_OUT_CONFREG LIMIT_X_OUT_CONFREG
#define DIO100_IN_CONFREG LIMIT_X_IN_CONFREG
#define DIO100_OUTREG LIMIT_X_OUTREG
#define DIO100_INREG LIMIT_X_INREG
#endif
#if (defined(LIMIT_Y_BIT))
#define LIMIT_Y 101
#if (LIMIT_Y_BIT < 32)
#define LIMIT_Y_MUXREG __io_mux__(LIMIT_Y_BIT)
#define LIMIT_Y_OUT_CONFREG __io_out_conf__(LIMIT_Y_BIT)
#define LIMIT_Y_IN_CONFREG __io_in_conf__(LIMIT_Y_BIT)
#define LIMIT_Y_OUTREG OUT0
#define LIMIT_Y_INREG IN0
#else
#define LIMIT_Y_OUTREG OUT1
#define LIMIT_Y_INREG IN1
#endif
#define DIO101 101
#define DIO101_BIT LIMIT_Y_BIT
#define DIO101_MUXREG LIMIT_Y_MUXREG
#define DIO101_OUT_CONFREG LIMIT_Y_OUT_CONFREG
#define DIO101_IN_CONFREG LIMIT_Y_IN_CONFREG
#define DIO101_OUTREG LIMIT_Y_OUTREG
#define DIO101_INREG LIMIT_Y_INREG
#endif
#if (defined(LIMIT_Z_BIT))
#define LIMIT_Z 102
#if (LIMIT_Z_BIT < 32)
#define LIMIT_Z_MUXREG __io_mux__(LIMIT_Z_BIT)
#define LIMIT_Z_OUT_CONFREG __io_out_conf__(LIMIT_Z_BIT)
#define LIMIT_Z_IN_CONFREG __io_in_conf__(LIMIT_Z_BIT)
#define LIMIT_Z_OUTREG OUT0
#define LIMIT_Z_INREG IN0
#else
#define LIMIT_Z_OUTREG OUT1
#define LIMIT_Z_INREG IN1
#endif
#define DIO102 102
#define DIO102_BIT LIMIT_Z_BIT
#define DIO102_MUXREG LIMIT_Z_MUXREG
#define DIO102_OUT_CONFREG LIMIT_Z_OUT_CONFREG
#define DIO102_IN_CONFREG LIMIT_Z_IN_CONFREG
#define DIO102_OUTREG LIMIT_Z_OUTREG
#define DIO102_INREG LIMIT_Z_INREG
#endif
#if (defined(LIMIT_X2_BIT))
#define LIMIT_X2 103
#if (LIMIT_X2_BIT < 32)
#define LIMIT_X2_MUXREG __io_mux__(LIMIT_X2_BIT)
#define LIMIT_X2_OUT_CONFREG __io_out_conf__(LIMIT_X2_BIT)
#define LIMIT_X2_IN_CONFREG __io_in_conf__(LIMIT_X2_BIT)
#define LIMIT_X2_OUTREG OUT0
#define LIMIT_X2_INREG IN0
#else
#define LIMIT_X2_OUTREG OUT1
#define LIMIT_X2_INREG IN1
#endif
#define DIO103 103
#define DIO103_BIT LIMIT_X2_BIT
#define DIO103_MUXREG LIMIT_X2_MUXREG
#define DIO103_OUT_CONFREG LIMIT_X2_OUT_CONFREG
#define DIO103_IN_CONFREG LIMIT_X2_IN_CONFREG
#define DIO103_OUTREG LIMIT_X2_OUTREG
#define DIO103_INREG LIMIT_X2_INREG
#endif
#if (defined(LIMIT_Y2_BIT))
#define LIMIT_Y2 104
#if (LIMIT_Y2_BIT < 32)
#define LIMIT_Y2_MUXREG __io_mux__(LIMIT_Y2_BIT)
#define LIMIT_Y2_OUT_CONFREG __io_out_conf__(LIMIT_Y2_BIT)
#define LIMIT_Y2_IN_CONFREG __io_in_conf__(LIMIT_Y2_BIT)
#define LIMIT_Y2_OUTREG OUT0
#define LIMIT_Y2_INREG IN0
#else
#define LIMIT_Y2_OUTREG OUT1
#define LIMIT_Y2_INREG IN1
#endif
#define DIO104 104
#define DIO104_BIT LIMIT_Y2_BIT
#define DIO104_MUXREG LIMIT_Y2_MUXREG
#define DIO104_OUT_CONFREG LIMIT_Y2_OUT_CONFREG
#define DIO104_IN_CONFREG LIMIT_Y2_IN_CONFREG
#define DIO104_OUTREG LIMIT_Y2_OUTREG
#define DIO104_INREG LIMIT_Y2_INREG
#endif
#if (defined(LIMIT_Z2_BIT))
#define LIMIT_Z2 105
#if (LIMIT_Z2_BIT < 32)
#define LIMIT_Z2_MUXREG __io_mux__(LIMIT_Z2_BIT)
#define LIMIT_Z2_OUT_CONFREG __io_out_conf__(LIMIT_Z2_BIT)
#define LIMIT_Z2_IN_CONFREG __io_in_conf__(LIMIT_Z2_BIT)
#define LIMIT_Z2_OUTREG OUT0
#define LIMIT_Z2_INREG IN0
#else
#define LIMIT_Z2_OUTREG OUT1
#define LIMIT_Z2_INREG IN1
#endif
#define DIO105 105
#define DIO105_BIT LIMIT_Z2_BIT
#define DIO105_MUXREG LIMIT_Z2_MUXREG
#define DIO105_OUT_CONFREG LIMIT_Z2_OUT_CONFREG
#define DIO105_IN_CONFREG LIMIT_Z2_IN_CONFREG
#define DIO105_OUTREG LIMIT_Z2_OUTREG
#define DIO105_INREG LIMIT_Z2_INREG
#endif
#if (defined(LIMIT_A_BIT))
#define LIMIT_A 106
#if (LIMIT_A_BIT < 32)
#define LIMIT_A_MUXREG __io_mux__(LIMIT_A_BIT)
#define LIMIT_A_OUT_CONFREG __io_out_conf__(LIMIT_A_BIT)
#define LIMIT_A_IN_CONFREG __io_in_conf__(LIMIT_A_BIT)
#define LIMIT_A_OUTREG OUT0
#define LIMIT_A_INREG IN0
#else
#define LIMIT_A_OUTREG OUT1
#define LIMIT_A_INREG IN1
#endif
#define DIO106 106
#define DIO106_BIT LIMIT_A_BIT
#define DIO106_MUXREG LIMIT_A_MUXREG
#define DIO106_OUT_CONFREG LIMIT_A_OUT_CONFREG
#define DIO106_IN_CONFREG LIMIT_A_IN_CONFREG
#define DIO106_OUTREG LIMIT_A_OUTREG
#define DIO106_INREG LIMIT_A_INREG
#endif
#if (defined(LIMIT_B_BIT))
#define LIMIT_B 107
#if (LIMIT_B_BIT < 32)
#define LIMIT_B_MUXREG __io_mux__(LIMIT_B_BIT)
#define LIMIT_B_OUT_CONFREG __io_out_conf__(LIMIT_B_BIT)
#define LIMIT_B_IN_CONFREG __io_in_conf__(LIMIT_B_BIT)
#define LIMIT_B_OUTREG OUT0
#define LIMIT_B_INREG IN0
#else
#define LIMIT_B_OUTREG OUT1
#define LIMIT_B_INREG IN1
#endif
#define DIO107 107
#define DIO107_BIT LIMIT_B_BIT
#define DIO107_MUXREG LIMIT_B_MUXREG
#define DIO107_OUT_CONFREG LIMIT_B_OUT_CONFREG
#define DIO107_IN_CONFREG LIMIT_B_IN_CONFREG
#define DIO107_OUTREG LIMIT_B_OUTREG
#define DIO107_INREG LIMIT_B_INREG
#endif
#if (defined(LIMIT_C_BIT))
#define LIMIT_C 108
#if (LIMIT_C_BIT < 32)
#define LIMIT_C_MUXREG __io_mux__(LIMIT_C_BIT)
#define LIMIT_C_OUT_CONFREG __io_out_conf__(LIMIT_C_BIT)
#define LIMIT_C_IN_CONFREG __io_in_conf__(LIMIT_C_BIT)
#define LIMIT_C_OUTREG OUT0
#define LIMIT_C_INREG IN0
#else
#define LIMIT_C_OUTREG OUT1
#define LIMIT_C_INREG IN1
#endif
#define DIO108 108
#define DIO108_BIT LIMIT_C_BIT
#define DIO108_MUXREG LIMIT_C_MUXREG
#define DIO108_OUT_CONFREG LIMIT_C_OUT_CONFREG
#define DIO108_IN_CONFREG LIMIT_C_IN_CONFREG
#define DIO108_OUTREG LIMIT_C_OUTREG
#define DIO108_INREG LIMIT_C_INREG
#endif
#if (defined(PROBE_BIT))
#define PROBE 109
#if (PROBE_BIT < 32)
#define PROBE_MUXREG __io_mux__(PROBE_BIT)
#define PROBE_OUT_CONFREG __io_out_conf__(PROBE_BIT)
#define PROBE_IN_CONFREG __io_in_conf__(PROBE_BIT)
#define PROBE_OUTREG OUT0
#define PROBE_INREG IN0
#else
#define PROBE_OUTREG OUT1
#define PROBE_INREG IN1
#endif
#define DIO109 109
#define DIO109_BIT PROBE_BIT
#define DIO109_MUXREG PROBE_MUXREG
#define DIO109_OUT_CONFREG PROBE_OUT_CONFREG
#define DIO109_IN_CONFREG PROBE_IN_CONFREG
#define DIO109_OUTREG PROBE_OUTREG
#define DIO109_INREG PROBE_INREG
#endif
#if (defined(ESTOP_BIT))
#define ESTOP 110
#if (ESTOP_BIT < 32)
#define ESTOP_MUXREG __io_mux__(ESTOP_BIT)
#define ESTOP_OUT_CONFREG __io_out_conf__(ESTOP_BIT)
#define ESTOP_IN_CONFREG __io_in_conf__(ESTOP_BIT)
#define ESTOP_OUTREG OUT0
#define ESTOP_INREG IN0
#else
#define ESTOP_OUTREG OUT1
#define ESTOP_INREG IN1
#endif
#define DIO110 110
#define DIO110_BIT ESTOP_BIT
#define DIO110_MUXREG ESTOP_MUXREG
#define DIO110_OUT_CONFREG ESTOP_OUT_CONFREG
#define DIO110_IN_CONFREG ESTOP_IN_CONFREG
#define DIO110_OUTREG ESTOP_OUTREG
#define DIO110_INREG ESTOP_INREG
#endif
#if (defined(SAFETY_DOOR_BIT))
#define SAFETY_DOOR 111
#if (SAFETY_DOOR_BIT < 32)
#define SAFETY_DOOR_MUXREG __io_mux__(SAFETY_DOOR_BIT)
#define SAFETY_DOOR_OUT_CONFREG __io_out_conf__(SAFETY_DOOR_BIT)
#define SAFETY_DOOR_IN_CONFREG __io_in_conf__(SAFETY_DOOR_BIT)
#define SAFETY_DOOR_OUTREG OUT0
#define SAFETY_DOOR_INREG IN0
#else
#define SAFETY_DOOR_OUTREG OUT1
#define SAFETY_DOOR_INREG IN1
#endif
#define DIO111 111
#define DIO111_BIT SAFETY_DOOR_BIT
#define DIO111_MUXREG SAFETY_DOOR_MUXREG
#define DIO111_OUT_CONFREG SAFETY_DOOR_OUT_CONFREG
#define DIO111_IN_CONFREG SAFETY_DOOR_IN_CONFREG
#define DIO111_OUTREG SAFETY_DOOR_OUTREG
#define DIO111_INREG SAFETY_DOOR_INREG
#endif
#if (defined(FHOLD_BIT))
#define FHOLD 112
#if (FHOLD_BIT < 32)
#define FHOLD_MUXREG __io_mux__(FHOLD_BIT)
#define FHOLD_OUT_CONFREG __io_out_conf__(FHOLD_BIT)
#define FHOLD_IN_CONFREG __io_in_conf__(FHOLD_BIT)
#define FHOLD_OUTREG OUT0
#define FHOLD_INREG IN0
#else
#define FHOLD_OUTREG OUT1
#define FHOLD_INREG IN1
#endif
#define DIO112 112
#define DIO112_BIT FHOLD_BIT
#define DIO112_MUXREG FHOLD_MUXREG
#define DIO112_OUT_CONFREG FHOLD_OUT_CONFREG
#define DIO112_IN_CONFREG FHOLD_IN_CONFREG
#define DIO112_OUTREG FHOLD_OUTREG
#define DIO112_INREG FHOLD_INREG
#endif
#if (defined(CS_RES_BIT))
#define CS_RES 113
#if (CS_RES_BIT < 32)
#define CS_RES_MUXREG __io_mux__(CS_RES_BIT)
#define CS_RES_OUT_CONFREG __io_out_conf__(CS_RES_BIT)
#define CS_RES_IN_CONFREG __io_in_conf__(CS_RES_BIT)
#define CS_RES_OUTREG OUT0
#define CS_RES_INREG IN0
#else
#define CS_RES_OUTREG OUT1
#define CS_RES_INREG IN1
#endif
#define DIO113 113
#define DIO113_BIT CS_RES_BIT
#define DIO113_MUXREG CS_RES_MUXREG
#define DIO113_OUT_CONFREG CS_RES_OUT_CONFREG
#define DIO113_IN_CONFREG CS_RES_IN_CONFREG
#define DIO113_OUTREG CS_RES_OUTREG
#define DIO113_INREG CS_RES_INREG
#endif
#if (defined(ANALOG0_BIT))
#define ANALOG0 114
#if (ANALOG0_BIT < 32)
#define ANALOG0_MUXREG __io_mux__(ANALOG0_BIT)
#define ANALOG0_OUT_CONFREG __io_out_conf__(ANALOG0_BIT)
#define ANALOG0_IN_CONFREG __io_in_conf__(ANALOG0_BIT)
#define ANALOG0_OUTREG OUT0
#define ANALOG0_INREG IN0
#else
#define ANALOG0_OUTREG OUT1
#define ANALOG0_INREG IN1
#endif
#define DIO114 114
#define DIO114_BIT ANALOG0_BIT
#define DIO114_MUXREG ANALOG0_MUXREG
#define DIO114_OUT_CONFREG ANALOG0_OUT_CONFREG
#define DIO114_IN_CONFREG ANALOG0_IN_CONFREG
#define DIO114_OUTREG ANALOG0_OUTREG
#define DIO114_INREG ANALOG0_INREG
#endif
#if (defined(ANALOG1_BIT))
#define ANALOG1 115
#if (ANALOG1_BIT < 32)
#define ANALOG1_MUXREG __io_mux__(ANALOG1_BIT)
#define ANALOG1_OUT_CONFREG __io_out_conf__(ANALOG1_BIT)
#define ANALOG1_IN_CONFREG __io_in_conf__(ANALOG1_BIT)
#define ANALOG1_OUTREG OUT0
#define ANALOG1_INREG IN0
#else
#define ANALOG1_OUTREG OUT1
#define ANALOG1_INREG IN1
#endif
#define DIO115 115
#define DIO115_BIT ANALOG1_BIT
#define DIO115_MUXREG ANALOG1_MUXREG
#define DIO115_OUT_CONFREG ANALOG1_OUT_CONFREG
#define DIO115_IN_CONFREG ANALOG1_IN_CONFREG
#define DIO115_OUTREG ANALOG1_OUTREG
#define DIO115_INREG ANALOG1_INREG
#endif
#if (defined(ANALOG2_BIT))
#define ANALOG2 116
#if (ANALOG2_BIT < 32)
#define ANALOG2_MUXREG __io_mux__(ANALOG2_BIT)
#define ANALOG2_OUT_CONFREG __io_out_conf__(ANALOG2_BIT)
#define ANALOG2_IN_CONFREG __io_in_conf__(ANALOG2_BIT)
#define ANALOG2_OUTREG OUT0
#define ANALOG2_INREG IN0
#else
#define ANALOG2_OUTREG OUT1
#define ANALOG2_INREG IN1
#endif
#define DIO116 116
#define DIO116_BIT ANALOG2_BIT
#define DIO116_MUXREG ANALOG2_MUXREG
#define DIO116_OUT_CONFREG ANALOG2_OUT_CONFREG
#define DIO116_IN_CONFREG ANALOG2_IN_CONFREG
#define DIO116_OUTREG ANALOG2_OUTREG
#define DIO116_INREG ANALOG2_INREG
#endif
#if (defined(ANALOG3_BIT))
#define ANALOG3 117
#if (ANALOG3_BIT < 32)
#define ANALOG3_MUXREG __io_mux__(ANALOG3_BIT)
#define ANALOG3_OUT_CONFREG __io_out_conf__(ANALOG3_BIT)
#define ANALOG3_IN_CONFREG __io_in_conf__(ANALOG3_BIT)
#define ANALOG3_OUTREG OUT0
#define ANALOG3_INREG IN0
#else
#define ANALOG3_OUTREG OUT1
#define ANALOG3_INREG IN1
#endif
#define DIO117 117
#define DIO117_BIT ANALOG3_BIT
#define DIO117_MUXREG ANALOG3_MUXREG
#define DIO117_OUT_CONFREG ANALOG3_OUT_CONFREG
#define DIO117_IN_CONFREG ANALOG3_IN_CONFREG
#define DIO117_OUTREG ANALOG3_OUTREG
#define DIO117_INREG ANALOG3_INREG
#endif
#if (defined(ANALOG4_BIT))
#define ANALOG4 118
#if (ANALOG4_BIT < 32)
#define ANALOG4_MUXREG __io_mux__(ANALOG4_BIT)
#define ANALOG4_OUT_CONFREG __io_out_conf__(ANALOG4_BIT)
#define ANALOG4_IN_CONFREG __io_in_conf__(ANALOG4_BIT)
#define ANALOG4_OUTREG OUT0
#define ANALOG4_INREG IN0
#else
#define ANALOG4_OUTREG OUT1
#define ANALOG4_INREG IN1
#endif
#define DIO118 118
#define DIO118_BIT ANALOG4_BIT
#define DIO118_MUXREG ANALOG4_MUXREG
#define DIO118_OUT_CONFREG ANALOG4_OUT_CONFREG
#define DIO118_IN_CONFREG ANALOG4_IN_CONFREG
#define DIO118_OUTREG ANALOG4_OUTREG
#define DIO118_INREG ANALOG4_INREG
#endif
#if (defined(ANALOG5_BIT))
#define ANALOG5 119
#if (ANALOG5_BIT < 32)
#define ANALOG5_MUXREG __io_mux__(ANALOG5_BIT)
#define ANALOG5_OUT_CONFREG __io_out_conf__(ANALOG5_BIT)
#define ANALOG5_IN_CONFREG __io_in_conf__(ANALOG5_BIT)
#define ANALOG5_OUTREG OUT0
#define ANALOG5_INREG IN0
#else
