Paciente8159/uCNC/uCNC/src/hal/mcus/esp32s3/mcumap_esp32s3.h
#define ANALOG5_OUTREG OUT1
#define ANALOG5_INREG IN1
#endif
#define DIO119 119
#define DIO119_BIT ANALOG5_BIT
#define DIO119_MUXREG ANALOG5_MUXREG
#define DIO119_OUT_CONFREG ANALOG5_OUT_CONFREG
#define DIO119_IN_CONFREG ANALOG5_IN_CONFREG
#define DIO119_OUTREG ANALOG5_OUTREG
#define DIO119_INREG ANALOG5_INREG
#endif
#if (defined(ANALOG6_BIT))
#define ANALOG6 120
#if (ANALOG6_BIT < 32)
#define ANALOG6_MUXREG __io_mux__(ANALOG6_BIT)
#define ANALOG6_OUT_CONFREG __io_out_conf__(ANALOG6_BIT)
#define ANALOG6_IN_CONFREG __io_in_conf__(ANALOG6_BIT)
#define ANALOG6_OUTREG OUT0
#define ANALOG6_INREG IN0
#else
#define ANALOG6_OUTREG OUT1
#define ANALOG6_INREG IN1
#endif
#define DIO120 120
#define DIO120_BIT ANALOG6_BIT
#define DIO120_MUXREG ANALOG6_MUXREG
#define DIO120_OUT_CONFREG ANALOG6_OUT_CONFREG
#define DIO120_IN_CONFREG ANALOG6_IN_CONFREG
#define DIO120_OUTREG ANALOG6_OUTREG
#define DIO120_INREG ANALOG6_INREG
#endif
#if (defined(ANALOG7_BIT))
#define ANALOG7 121
#if (ANALOG7_BIT < 32)
#define ANALOG7_MUXREG __io_mux__(ANALOG7_BIT)
#define ANALOG7_OUT_CONFREG __io_out_conf__(ANALOG7_BIT)
#define ANALOG7_IN_CONFREG __io_in_conf__(ANALOG7_BIT)
#define ANALOG7_OUTREG OUT0
#define ANALOG7_INREG IN0
#else
#define ANALOG7_OUTREG OUT1
#define ANALOG7_INREG IN1
#endif
#define DIO121 121
#define DIO121_BIT ANALOG7_BIT
#define DIO121_MUXREG ANALOG7_MUXREG
#define DIO121_OUT_CONFREG ANALOG7_OUT_CONFREG
#define DIO121_IN_CONFREG ANALOG7_IN_CONFREG
#define DIO121_OUTREG ANALOG7_OUTREG
#define DIO121_INREG ANALOG7_INREG
#endif
#if (defined(ANALOG8_BIT))
#define ANALOG8 122
#if (ANALOG8_BIT < 32)
#define ANALOG8_MUXREG __io_mux__(ANALOG8_BIT)
#define ANALOG8_OUT_CONFREG __io_out_conf__(ANALOG8_BIT)
#define ANALOG8_IN_CONFREG __io_in_conf__(ANALOG8_BIT)
#define ANALOG8_OUTREG OUT0
#define ANALOG8_INREG IN0
#else
#define ANALOG8_OUTREG OUT1
#define ANALOG8_INREG IN1
#endif
#define DIO122 122
#define DIO122_BIT ANALOG8_BIT
#define DIO122_MUXREG ANALOG8_MUXREG
#define DIO122_OUT_CONFREG ANALOG8_OUT_CONFREG
#define DIO122_IN_CONFREG ANALOG8_IN_CONFREG
#define DIO122_OUTREG ANALOG8_OUTREG
#define DIO122_INREG ANALOG8_INREG
#endif
#if (defined(ANALOG9_BIT))
#define ANALOG9 123
#if (ANALOG9_BIT < 32)
#define ANALOG9_MUXREG __io_mux__(ANALOG9_BIT)
#define ANALOG9_OUT_CONFREG __io_out_conf__(ANALOG9_BIT)
#define ANALOG9_IN_CONFREG __io_in_conf__(ANALOG9_BIT)
#define ANALOG9_OUTREG OUT0
#define ANALOG9_INREG IN0
#else
#define ANALOG9_OUTREG OUT1
#define ANALOG9_INREG IN1
#endif
#define DIO123 123
#define DIO123_BIT ANALOG9_BIT
#define DIO123_MUXREG ANALOG9_MUXREG
#define DIO123_OUT_CONFREG ANALOG9_OUT_CONFREG
#define DIO123_IN_CONFREG ANALOG9_IN_CONFREG
#define DIO123_OUTREG ANALOG9_OUTREG
#define DIO123_INREG ANALOG9_INREG
#endif
#if (defined(ANALOG10_BIT))
#define ANALOG10 124
#if (ANALOG10_BIT < 32)
#define ANALOG10_MUXREG __io_mux__(ANALOG10_BIT)
#define ANALOG10_OUT_CONFREG __io_out_conf__(ANALOG10_BIT)
#define ANALOG10_IN_CONFREG __io_in_conf__(ANALOG10_BIT)
#define ANALOG10_OUTREG OUT0
#define ANALOG10_INREG IN0
#else
#define ANALOG10_OUTREG OUT1
#define ANALOG10_INREG IN1
#endif
#define DIO124 124
#define DIO124_BIT ANALOG10_BIT
#define DIO124_MUXREG ANALOG10_MUXREG
#define DIO124_OUT_CONFREG ANALOG10_OUT_CONFREG
#define DIO124_IN_CONFREG ANALOG10_IN_CONFREG
#define DIO124_OUTREG ANALOG10_OUTREG
#define DIO124_INREG ANALOG10_INREG
#endif
#if (defined(ANALOG11_BIT))
#define ANALOG11 125
#if (ANALOG11_BIT < 32)
#define ANALOG11_MUXREG __io_mux__(ANALOG11_BIT)
#define ANALOG11_OUT_CONFREG __io_out_conf__(ANALOG11_BIT)
#define ANALOG11_IN_CONFREG __io_in_conf__(ANALOG11_BIT)
#define ANALOG11_OUTREG OUT0
#define ANALOG11_INREG IN0
#else
#define ANALOG11_OUTREG OUT1
#define ANALOG11_INREG IN1
#endif
#define DIO125 125
#define DIO125_BIT ANALOG11_BIT
#define DIO125_MUXREG ANALOG11_MUXREG
#define DIO125_OUT_CONFREG ANALOG11_OUT_CONFREG
#define DIO125_IN_CONFREG ANALOG11_IN_CONFREG
#define DIO125_OUTREG ANALOG11_OUTREG
#define DIO125_INREG ANALOG11_INREG
#endif
#if (defined(ANALOG12_BIT))
#define ANALOG12 126
#if (ANALOG12_BIT < 32)
#define ANALOG12_MUXREG __io_mux__(ANALOG12_BIT)
#define ANALOG12_OUT_CONFREG __io_out_conf__(ANALOG12_BIT)
#define ANALOG12_IN_CONFREG __io_in_conf__(ANALOG12_BIT)
#define ANALOG12_OUTREG OUT0
#define ANALOG12_INREG IN0
#else
#define ANALOG12_OUTREG OUT1
#define ANALOG12_INREG IN1
#endif
#define DIO126 126
#define DIO126_BIT ANALOG12_BIT
#define DIO126_MUXREG ANALOG12_MUXREG
#define DIO126_OUT_CONFREG ANALOG12_OUT_CONFREG
#define DIO126_IN_CONFREG ANALOG12_IN_CONFREG
#define DIO126_OUTREG ANALOG12_OUTREG
#define DIO126_INREG ANALOG12_INREG
#endif
#if (defined(ANALOG13_BIT))
#define ANALOG13 127
#if (ANALOG13_BIT < 32)
#define ANALOG13_MUXREG __io_mux__(ANALOG13_BIT)
#define ANALOG13_OUT_CONFREG __io_out_conf__(ANALOG13_BIT)
#define ANALOG13_IN_CONFREG __io_in_conf__(ANALOG13_BIT)
#define ANALOG13_OUTREG OUT0
#define ANALOG13_INREG IN0
#else
#define ANALOG13_OUTREG OUT1
#define ANALOG13_INREG IN1
#endif
#define DIO127 127
#define DIO127_BIT ANALOG13_BIT
#define DIO127_MUXREG ANALOG13_MUXREG
#define DIO127_OUT_CONFREG ANALOG13_OUT_CONFREG
#define DIO127_IN_CONFREG ANALOG13_IN_CONFREG
#define DIO127_OUTREG ANALOG13_OUTREG
#define DIO127_INREG ANALOG13_INREG
#endif
#if (defined(ANALOG14_BIT))
#define ANALOG14 128
#if (ANALOG14_BIT < 32)
#define ANALOG14_MUXREG __io_mux__(ANALOG14_BIT)
#define ANALOG14_OUT_CONFREG __io_out_conf__(ANALOG14_BIT)
#define ANALOG14_IN_CONFREG __io_in_conf__(ANALOG14_BIT)
#define ANALOG14_OUTREG OUT0
#define ANALOG14_INREG IN0
#else
#define ANALOG14_OUTREG OUT1
#define ANALOG14_INREG IN1
#endif
#define DIO128 128
#define DIO128_BIT ANALOG14_BIT
#define DIO128_MUXREG ANALOG14_MUXREG
#define DIO128_OUT_CONFREG ANALOG14_OUT_CONFREG
#define DIO128_IN_CONFREG ANALOG14_IN_CONFREG
#define DIO128_OUTREG ANALOG14_OUTREG
#define DIO128_INREG ANALOG14_INREG
#endif
#if (defined(ANALOG15_BIT))
#define ANALOG15 129
#if (ANALOG15_BIT < 32)
#define ANALOG15_MUXREG __io_mux__(ANALOG15_BIT)
#define ANALOG15_OUT_CONFREG __io_out_conf__(ANALOG15_BIT)
#define ANALOG15_IN_CONFREG __io_in_conf__(ANALOG15_BIT)
#define ANALOG15_OUTREG OUT0
#define ANALOG15_INREG IN0
#else
#define ANALOG15_OUTREG OUT1
#define ANALOG15_INREG IN1
#endif
#define DIO129 129
#define DIO129_BIT ANALOG15_BIT
#define DIO129_MUXREG ANALOG15_MUXREG
#define DIO129_OUT_CONFREG ANALOG15_OUT_CONFREG
#define DIO129_IN_CONFREG ANALOG15_IN_CONFREG
#define DIO129_OUTREG ANALOG15_OUTREG
#define DIO129_INREG ANALOG15_INREG
#endif
#if (defined(DIN0_BIT))
#define DIN0 130
#if (DIN0_BIT < 32)
#define DIN0_MUXREG __io_mux__(DIN0_BIT)
#define DIN0_OUT_CONFREG __io_out_conf__(DIN0_BIT)
#define DIN0_IN_CONFREG __io_in_conf__(DIN0_BIT)
#define DIN0_OUTREG OUT0
#define DIN0_INREG IN0
#else
#define DIN0_OUTREG OUT1
#define DIN0_INREG IN1
#endif
#define DIO130 130
#define DIO130_BIT DIN0_BIT
#define DIO130_MUXREG DIN0_MUXREG
#define DIO130_OUT_CONFREG DIN0_OUT_CONFREG
#define DIO130_IN_CONFREG DIN0_IN_CONFREG
#define DIO130_OUTREG DIN0_OUTREG
#define DIO130_INREG DIN0_INREG
#endif
#if (defined(DIN1_BIT))
#define DIN1 131
#if (DIN1_BIT < 32)
#define DIN1_MUXREG __io_mux__(DIN1_BIT)
#define DIN1_OUT_CONFREG __io_out_conf__(DIN1_BIT)
#define DIN1_IN_CONFREG __io_in_conf__(DIN1_BIT)
#define DIN1_OUTREG OUT0
#define DIN1_INREG IN0
#else
#define DIN1_OUTREG OUT1
#define DIN1_INREG IN1
#endif
#define DIO131 131
#define DIO131_BIT DIN1_BIT
#define DIO131_MUXREG DIN1_MUXREG
#define DIO131_OUT_CONFREG DIN1_OUT_CONFREG
#define DIO131_IN_CONFREG DIN1_IN_CONFREG
#define DIO131_OUTREG DIN1_OUTREG
#define DIO131_INREG DIN1_INREG
#endif
#if (defined(DIN2_BIT))
#define DIN2 132
#if (DIN2_BIT < 32)
#define DIN2_MUXREG __io_mux__(DIN2_BIT)
#define DIN2_OUT_CONFREG __io_out_conf__(DIN2_BIT)
#define DIN2_IN_CONFREG __io_in_conf__(DIN2_BIT)
#define DIN2_OUTREG OUT0
#define DIN2_INREG IN0
#else
#define DIN2_OUTREG OUT1
#define DIN2_INREG IN1
#endif
#define DIO132 132
#define DIO132_BIT DIN2_BIT
#define DIO132_MUXREG DIN2_MUXREG
#define DIO132_OUT_CONFREG DIN2_OUT_CONFREG
#define DIO132_IN_CONFREG DIN2_IN_CONFREG
#define DIO132_OUTREG DIN2_OUTREG
#define DIO132_INREG DIN2_INREG
#endif
#if (defined(DIN3_BIT))
#define DIN3 133
#if (DIN3_BIT < 32)
#define DIN3_MUXREG __io_mux__(DIN3_BIT)
#define DIN3_OUT_CONFREG __io_out_conf__(DIN3_BIT)
#define DIN3_IN_CONFREG __io_in_conf__(DIN3_BIT)
#define DIN3_OUTREG OUT0
#define DIN3_INREG IN0
#else
#define DIN3_OUTREG OUT1
#define DIN3_INREG IN1
#endif
#define DIO133 133
#define DIO133_BIT DIN3_BIT
#define DIO133_MUXREG DIN3_MUXREG
#define DIO133_OUT_CONFREG DIN3_OUT_CONFREG
#define DIO133_IN_CONFREG DIN3_IN_CONFREG
#define DIO133_OUTREG DIN3_OUTREG
#define DIO133_INREG DIN3_INREG
#endif
#if (defined(DIN4_BIT))
#define DIN4 134
#if (DIN4_BIT < 32)
#define DIN4_MUXREG __io_mux__(DIN4_BIT)
#define DIN4_OUT_CONFREG __io_out_conf__(DIN4_BIT)
#define DIN4_IN_CONFREG __io_in_conf__(DIN4_BIT)
#define DIN4_OUTREG OUT0
#define DIN4_INREG IN0
#else
#define DIN4_OUTREG OUT1
#define DIN4_INREG IN1
#endif
#define DIO134 134
#define DIO134_BIT DIN4_BIT
#define DIO134_MUXREG DIN4_MUXREG
#define DIO134_OUT_CONFREG DIN4_OUT_CONFREG
#define DIO134_IN_CONFREG DIN4_IN_CONFREG
#define DIO134_OUTREG DIN4_OUTREG
#define DIO134_INREG DIN4_INREG
#endif
#if (defined(DIN5_BIT))
#define DIN5 135
#if (DIN5_BIT < 32)
#define DIN5_MUXREG __io_mux__(DIN5_BIT)
#define DIN5_OUT_CONFREG __io_out_conf__(DIN5_BIT)
#define DIN5_IN_CONFREG __io_in_conf__(DIN5_BIT)
#define DIN5_OUTREG OUT0
#define DIN5_INREG IN0
#else
#define DIN5_OUTREG OUT1
#define DIN5_INREG IN1
#endif
#define DIO135 135
#define DIO135_BIT DIN5_BIT
#define DIO135_MUXREG DIN5_MUXREG
#define DIO135_OUT_CONFREG DIN5_OUT_CONFREG
#define DIO135_IN_CONFREG DIN5_IN_CONFREG
#define DIO135_OUTREG DIN5_OUTREG
#define DIO135_INREG DIN5_INREG
#endif
#if (defined(DIN6_BIT))
#define DIN6 136
#if (DIN6_BIT < 32)
#define DIN6_MUXREG __io_mux__(DIN6_BIT)
#define DIN6_OUT_CONFREG __io_out_conf__(DIN6_BIT)
#define DIN6_IN_CONFREG __io_in_conf__(DIN6_BIT)
#define DIN6_OUTREG OUT0
#define DIN6_INREG IN0
#else
#define DIN6_OUTREG OUT1
#define DIN6_INREG IN1
#endif
#define DIO136 136
#define DIO136_BIT DIN6_BIT
#define DIO136_MUXREG DIN6_MUXREG
#define DIO136_OUT_CONFREG DIN6_OUT_CONFREG
#define DIO136_IN_CONFREG DIN6_IN_CONFREG
#define DIO136_OUTREG DIN6_OUTREG
#define DIO136_INREG DIN6_INREG
#endif
#if (defined(DIN7_BIT))
#define DIN7 137
#if (DIN7_BIT < 32)
#define DIN7_MUXREG __io_mux__(DIN7_BIT)
#define DIN7_OUT_CONFREG __io_out_conf__(DIN7_BIT)
#define DIN7_IN_CONFREG __io_in_conf__(DIN7_BIT)
#define DIN7_OUTREG OUT0
#define DIN7_INREG IN0
#else
#define DIN7_OUTREG OUT1
#define DIN7_INREG IN1
#endif
#define DIO137 137
#define DIO137_BIT DIN7_BIT
#define DIO137_MUXREG DIN7_MUXREG
#define DIO137_OUT_CONFREG DIN7_OUT_CONFREG
#define DIO137_IN_CONFREG DIN7_IN_CONFREG
#define DIO137_OUTREG DIN7_OUTREG
#define DIO137_INREG DIN7_INREG
#endif
#if (defined(DIN8_BIT))
#define DIN8 138
#if (DIN8_BIT < 32)
#define DIN8_MUXREG __io_mux__(DIN8_BIT)
#define DIN8_OUT_CONFREG __io_out_conf__(DIN8_BIT)
#define DIN8_IN_CONFREG __io_in_conf__(DIN8_BIT)
#define DIN8_OUTREG OUT0
#define DIN8_INREG IN0
#else
#define DIN8_OUTREG OUT1
#define DIN8_INREG IN1
#endif
#define DIO138 138
#define DIO138_BIT DIN8_BIT
#define DIO138_MUXREG DIN8_MUXREG
#define DIO138_OUT_CONFREG DIN8_OUT_CONFREG
#define DIO138_IN_CONFREG DIN8_IN_CONFREG
#define DIO138_OUTREG DIN8_OUTREG
#define DIO138_INREG DIN8_INREG
#endif
#if (defined(DIN9_BIT))
#define DIN9 139
#if (DIN9_BIT < 32)
#define DIN9_MUXREG __io_mux__(DIN9_BIT)
#define DIN9_OUT_CONFREG __io_out_conf__(DIN9_BIT)
#define DIN9_IN_CONFREG __io_in_conf__(DIN9_BIT)
#define DIN9_OUTREG OUT0
#define DIN9_INREG IN0
#else
#define DIN9_OUTREG OUT1
#define DIN9_INREG IN1
#endif
#define DIO139 139
#define DIO139_BIT DIN9_BIT
#define DIO139_MUXREG DIN9_MUXREG
#define DIO139_OUT_CONFREG DIN9_OUT_CONFREG
#define DIO139_IN_CONFREG DIN9_IN_CONFREG
#define DIO139_OUTREG DIN9_OUTREG
#define DIO139_INREG DIN9_INREG
#endif
#if (defined(DIN10_BIT))
#define DIN10 140
#if (DIN10_BIT < 32)
#define DIN10_MUXREG __io_mux__(DIN10_BIT)
#define DIN10_OUT_CONFREG __io_out_conf__(DIN10_BIT)
#define DIN10_IN_CONFREG __io_in_conf__(DIN10_BIT)
#define DIN10_OUTREG OUT0
#define DIN10_INREG IN0
#else
#define DIN10_OUTREG OUT1
#define DIN10_INREG IN1
#endif
#define DIO140 140
#define DIO140_BIT DIN10_BIT
#define DIO140_MUXREG DIN10_MUXREG
#define DIO140_OUT_CONFREG DIN10_OUT_CONFREG
#define DIO140_IN_CONFREG DIN10_IN_CONFREG
#define DIO140_OUTREG DIN10_OUTREG
#define DIO140_INREG DIN10_INREG
#endif
#if (defined(DIN11_BIT))
#define DIN11 141
#if (DIN11_BIT < 32)
#define DIN11_MUXREG __io_mux__(DIN11_BIT)
#define DIN11_OUT_CONFREG __io_out_conf__(DIN11_BIT)
#define DIN11_IN_CONFREG __io_in_conf__(DIN11_BIT)
#define DIN11_OUTREG OUT0
#define DIN11_INREG IN0
#else
#define DIN11_OUTREG OUT1
#define DIN11_INREG IN1
#endif
#define DIO141 141
#define DIO141_BIT DIN11_BIT
#define DIO141_MUXREG DIN11_MUXREG
#define DIO141_OUT_CONFREG DIN11_OUT_CONFREG
#define DIO141_IN_CONFREG DIN11_IN_CONFREG
#define DIO141_OUTREG DIN11_OUTREG
#define DIO141_INREG DIN11_INREG
#endif
#if (defined(DIN12_BIT))
#define DIN12 142
#if (DIN12_BIT < 32)
#define DIN12_MUXREG __io_mux__(DIN12_BIT)
#define DIN12_OUT_CONFREG __io_out_conf__(DIN12_BIT)
#define DIN12_IN_CONFREG __io_in_conf__(DIN12_BIT)
#define DIN12_OUTREG OUT0
#define DIN12_INREG IN0
#else
#define DIN12_OUTREG OUT1
#define DIN12_INREG IN1
#endif
#define DIO142 142
#define DIO142_BIT DIN12_BIT
#define DIO142_MUXREG DIN12_MUXREG
#define DIO142_OUT_CONFREG DIN12_OUT_CONFREG
#define DIO142_IN_CONFREG DIN12_IN_CONFREG
#define DIO142_OUTREG DIN12_OUTREG
#define DIO142_INREG DIN12_INREG
#endif
#if (defined(DIN13_BIT))
#define DIN13 143
#if (DIN13_BIT < 32)
#define DIN13_MUXREG __io_mux__(DIN13_BIT)
#define DIN13_OUT_CONFREG __io_out_conf__(DIN13_BIT)
#define DIN13_IN_CONFREG __io_in_conf__(DIN13_BIT)
#define DIN13_OUTREG OUT0
#define DIN13_INREG IN0
#else
#define DIN13_OUTREG OUT1
#define DIN13_INREG IN1
#endif
#define DIO143 143
#define DIO143_BIT DIN13_BIT
#define DIO143_MUXREG DIN13_MUXREG
#define DIO143_OUT_CONFREG DIN13_OUT_CONFREG
#define DIO143_IN_CONFREG DIN13_IN_CONFREG
#define DIO143_OUTREG DIN13_OUTREG
#define DIO143_INREG DIN13_INREG
#endif
#if (defined(DIN14_BIT))
#define DIN14 144
#if (DIN14_BIT < 32)
#define DIN14_MUXREG __io_mux__(DIN14_BIT)
#define DIN14_OUT_CONFREG __io_out_conf__(DIN14_BIT)
#define DIN14_IN_CONFREG __io_in_conf__(DIN14_BIT)
#define DIN14_OUTREG OUT0
#define DIN14_INREG IN0
#else
#define DIN14_OUTREG OUT1
#define DIN14_INREG IN1
#endif
#define DIO144 144
#define DIO144_BIT DIN14_BIT
#define DIO144_MUXREG DIN14_MUXREG
#define DIO144_OUT_CONFREG DIN14_OUT_CONFREG
#define DIO144_IN_CONFREG DIN14_IN_CONFREG
#define DIO144_OUTREG DIN14_OUTREG
#define DIO144_INREG DIN14_INREG
#endif
#if (defined(DIN15_BIT))
#define DIN15 145
#if (DIN15_BIT < 32)
#define DIN15_MUXREG __io_mux__(DIN15_BIT)
#define DIN15_OUT_CONFREG __io_out_conf__(DIN15_BIT)
#define DIN15_IN_CONFREG __io_in_conf__(DIN15_BIT)
#define DIN15_OUTREG OUT0
#define DIN15_INREG IN0
#else
#define DIN15_OUTREG OUT1
#define DIN15_INREG IN1
#endif
#define DIO145 145
#define DIO145_BIT DIN15_BIT
#define DIO145_MUXREG DIN15_MUXREG
#define DIO145_OUT_CONFREG DIN15_OUT_CONFREG
#define DIO145_IN_CONFREG DIN15_IN_CONFREG
#define DIO145_OUTREG DIN15_OUTREG
#define DIO145_INREG DIN15_INREG
#endif
#if (defined(DIN16_BIT))
#define DIN16 146
#if (DIN16_BIT < 32)
#define DIN16_MUXREG __io_mux__(DIN16_BIT)
#define DIN16_OUT_CONFREG __io_out_conf__(DIN16_BIT)
#define DIN16_IN_CONFREG __io_in_conf__(DIN16_BIT)
#define DIN16_OUTREG OUT0
#define DIN16_INREG IN0
#else
#define DIN16_OUTREG OUT1
#define DIN16_INREG IN1
#endif
#define DIO146 146
#define DIO146_BIT DIN16_BIT
#define DIO146_MUXREG DIN16_MUXREG
#define DIO146_OUT_CONFREG DIN16_OUT_CONFREG
#define DIO146_IN_CONFREG DIN16_IN_CONFREG
#define DIO146_OUTREG DIN16_OUTREG
#define DIO146_INREG DIN16_INREG
#endif
#if (defined(DIN17_BIT))
#define DIN17 147
#if (DIN17_BIT < 32)
#define DIN17_MUXREG __io_mux__(DIN17_BIT)
#define DIN17_OUT_CONFREG __io_out_conf__(DIN17_BIT)
#define DIN17_IN_CONFREG __io_in_conf__(DIN17_BIT)
#define DIN17_OUTREG OUT0
#define DIN17_INREG IN0
#else
#define DIN17_OUTREG OUT1
#define DIN17_INREG IN1
#endif
#define DIO147 147
#define DIO147_BIT DIN17_BIT
#define DIO147_MUXREG DIN17_MUXREG
#define DIO147_OUT_CONFREG DIN17_OUT_CONFREG
#define DIO147_IN_CONFREG DIN17_IN_CONFREG
#define DIO147_OUTREG DIN17_OUTREG
#define DIO147_INREG DIN17_INREG
#endif
#if (defined(DIN18_BIT))
#define DIN18 148
#if (DIN18_BIT < 32)
#define DIN18_MUXREG __io_mux__(DIN18_BIT)
#define DIN18_OUT_CONFREG __io_out_conf__(DIN18_BIT)
#define DIN18_IN_CONFREG __io_in_conf__(DIN18_BIT)
#define DIN18_OUTREG OUT0
#define DIN18_INREG IN0
#else
#define DIN18_OUTREG OUT1
#define DIN18_INREG IN1
#endif
#define DIO148 148
#define DIO148_BIT DIN18_BIT
#define DIO148_MUXREG DIN18_MUXREG
#define DIO148_OUT_CONFREG DIN18_OUT_CONFREG
#define DIO148_IN_CONFREG DIN18_IN_CONFREG
#define DIO148_OUTREG DIN18_OUTREG
#define DIO148_INREG DIN18_INREG
#endif
#if (defined(DIN19_BIT))
#define DIN19 149
#if (DIN19_BIT < 32)
#define DIN19_MUXREG __io_mux__(DIN19_BIT)
#define DIN19_OUT_CONFREG __io_out_conf__(DIN19_BIT)
#define DIN19_IN_CONFREG __io_in_conf__(DIN19_BIT)
#define DIN19_OUTREG OUT0
#define DIN19_INREG IN0
#else
#define DIN19_OUTREG OUT1
#define DIN19_INREG IN1
#endif
#define DIO149 149
#define DIO149_BIT DIN19_BIT
#define DIO149_MUXREG DIN19_MUXREG
#define DIO149_OUT_CONFREG DIN19_OUT_CONFREG
#define DIO149_IN_CONFREG DIN19_IN_CONFREG
#define DIO149_OUTREG DIN19_OUTREG
#define DIO149_INREG DIN19_INREG
#endif
#if (defined(DIN20_BIT))
#define DIN20 150
#if (DIN20_BIT < 32)
#define DIN20_MUXREG __io_mux__(DIN20_BIT)
#define DIN20_OUT_CONFREG __io_out_conf__(DIN20_BIT)
#define DIN20_IN_CONFREG __io_in_conf__(DIN20_BIT)
#define DIN20_OUTREG OUT0
#define DIN20_INREG IN0
#else
#define DIN20_OUTREG OUT1
#define DIN20_INREG IN1
#endif
#define DIO150 150
#define DIO150_BIT DIN20_BIT
#define DIO150_MUXREG DIN20_MUXREG
#define DIO150_OUT_CONFREG DIN20_OUT_CONFREG
#define DIO150_IN_CONFREG DIN20_IN_CONFREG
#define DIO150_OUTREG DIN20_OUTREG
#define DIO150_INREG DIN20_INREG
#endif
#if (defined(DIN21_BIT))
#define DIN21 151
#if (DIN21_BIT < 32)
#define DIN21_MUXREG __io_mux__(DIN21_BIT)
#define DIN21_OUT_CONFREG __io_out_conf__(DIN21_BIT)
#define DIN21_IN_CONFREG __io_in_conf__(DIN21_BIT)
#define DIN21_OUTREG OUT0
#define DIN21_INREG IN0
#else
#define DIN21_OUTREG OUT1
#define DIN21_INREG IN1
#endif
#define DIO151 151
#define DIO151_BIT DIN21_BIT
#define DIO151_MUXREG DIN21_MUXREG
#define DIO151_OUT_CONFREG DIN21_OUT_CONFREG
#define DIO151_IN_CONFREG DIN21_IN_CONFREG
#define DIO151_OUTREG DIN21_OUTREG
#define DIO151_INREG DIN21_INREG
#endif
#if (defined(DIN22_BIT))
#define DIN22 152
#if (DIN22_BIT < 32)
#define DIN22_MUXREG __io_mux__(DIN22_BIT)
#define DIN22_OUT_CONFREG __io_out_conf__(DIN22_BIT)
#define DIN22_IN_CONFREG __io_in_conf__(DIN22_BIT)
#define DIN22_OUTREG OUT0
#define DIN22_INREG IN0
#else
#define DIN22_OUTREG OUT1
#define DIN22_INREG IN1
#endif
#define DIO152 152
#define DIO152_BIT DIN22_BIT
#define DIO152_MUXREG DIN22_MUXREG
#define DIO152_OUT_CONFREG DIN22_OUT_CONFREG
#define DIO152_IN_CONFREG DIN22_IN_CONFREG
#define DIO152_OUTREG DIN22_OUTREG
#define DIO152_INREG DIN22_INREG
#endif
#if (defined(DIN23_BIT))
#define DIN23 153
#if (DIN23_BIT < 32)
#define DIN23_MUXREG __io_mux__(DIN23_BIT)
#define DIN23_OUT_CONFREG __io_out_conf__(DIN23_BIT)
#define DIN23_IN_CONFREG __io_in_conf__(DIN23_BIT)
#define DIN23_OUTREG OUT0
#define DIN23_INREG IN0
#else
#define DIN23_OUTREG OUT1
#define DIN23_INREG IN1
#endif
#define DIO153 153
#define DIO153_BIT DIN23_BIT
#define DIO153_MUXREG DIN23_MUXREG
#define DIO153_OUT_CONFREG DIN23_OUT_CONFREG
#define DIO153_IN_CONFREG DIN23_IN_CONFREG
#define DIO153_OUTREG DIN23_OUTREG
#define DIO153_INREG DIN23_INREG
#endif
#if (defined(DIN24_BIT))
#define DIN24 154
#if (DIN24_BIT < 32)
#define DIN24_MUXREG __io_mux__(DIN24_BIT)
#define DIN24_OUT_CONFREG __io_out_conf__(DIN24_BIT)
#define DIN24_IN_CONFREG __io_in_conf__(DIN24_BIT)
#define DIN24_OUTREG OUT0
#define DIN24_INREG IN0
#else
#define DIN24_OUTREG OUT1
#define DIN24_INREG IN1
#endif
#define DIO154 154
#define DIO154_BIT DIN24_BIT
#define DIO154_MUXREG DIN24_MUXREG
#define DIO154_OUT_CONFREG DIN24_OUT_CONFREG
#define DIO154_IN_CONFREG DIN24_IN_CONFREG
#define DIO154_OUTREG DIN24_OUTREG
#define DIO154_INREG DIN24_INREG
#endif
#if (defined(DIN25_BIT))
#define DIN25 155
#if (DIN25_BIT < 32)
#define DIN25_MUXREG __io_mux__(DIN25_BIT)
#define DIN25_OUT_CONFREG __io_out_conf__(DIN25_BIT)
#define DIN25_IN_CONFREG __io_in_conf__(DIN25_BIT)
#define DIN25_OUTREG OUT0
#define DIN25_INREG IN0
#else
#define DIN25_OUTREG OUT1
#define DIN25_INREG IN1
#endif
#define DIO155 155
#define DIO155_BIT DIN25_BIT
#define DIO155_MUXREG DIN25_MUXREG
#define DIO155_OUT_CONFREG DIN25_OUT_CONFREG
#define DIO155_IN_CONFREG DIN25_IN_CONFREG
#define DIO155_OUTREG DIN25_OUTREG
#define DIO155_INREG DIN25_INREG
#endif
#if (defined(DIN26_BIT))
#define DIN26 156
#if (DIN26_BIT < 32)
#define DIN26_MUXREG __io_mux__(DIN26_BIT)
#define DIN26_OUT_CONFREG __io_out_conf__(DIN26_BIT)
#define DIN26_IN_CONFREG __io_in_conf__(DIN26_BIT)
#define DIN26_OUTREG OUT0
#define DIN26_INREG IN0
#else
#define DIN26_OUTREG OUT1
#define DIN26_INREG IN1
#endif
#define DIO156 156
#define DIO156_BIT DIN26_BIT
#define DIO156_MUXREG DIN26_MUXREG
#define DIO156_OUT_CONFREG DIN26_OUT_CONFREG
#define DIO156_IN_CONFREG DIN26_IN_CONFREG
#define DIO156_OUTREG DIN26_OUTREG
#define DIO156_INREG DIN26_INREG
#endif
#if (defined(DIN27_BIT))
#define DIN27 157
#if (DIN27_BIT < 32)
#define DIN27_MUXREG __io_mux__(DIN27_BIT)
#define DIN27_OUT_CONFREG __io_out_conf__(DIN27_BIT)
#define DIN27_IN_CONFREG __io_in_conf__(DIN27_BIT)
#define DIN27_OUTREG OUT0
#define DIN27_INREG IN0
#else
#define DIN27_OUTREG OUT1
#define DIN27_INREG IN1
#endif
#define DIO157 157
#define DIO157_BIT DIN27_BIT
#define DIO157_MUXREG DIN27_MUXREG
#define DIO157_OUT_CONFREG DIN27_OUT_CONFREG
#define DIO157_IN_CONFREG DIN27_IN_CONFREG
#define DIO157_OUTREG DIN27_OUTREG
#define DIO157_INREG DIN27_INREG
#endif
#if (defined(DIN28_BIT))
#define DIN28 158
#if (DIN28_BIT < 32)
#define DIN28_MUXREG __io_mux__(DIN28_BIT)
#define DIN28_OUT_CONFREG __io_out_conf__(DIN28_BIT)
#define DIN28_IN_CONFREG __io_in_conf__(DIN28_BIT)
#define DIN28_OUTREG OUT0
#define DIN28_INREG IN0
#else
#define DIN28_OUTREG OUT1
#define DIN28_INREG IN1
#endif
#define DIO158 158
#define DIO158_BIT DIN28_BIT
#define DIO158_MUXREG DIN28_MUXREG
#define DIO158_OUT_CONFREG DIN28_OUT_CONFREG
#define DIO158_IN_CONFREG DIN28_IN_CONFREG
#define DIO158_OUTREG DIN28_OUTREG
#define DIO158_INREG DIN28_INREG
#endif
#if (defined(DIN29_BIT))
#define DIN29 159
#if (DIN29_BIT < 32)
#define DIN29_MUXREG __io_mux__(DIN29_BIT)
#define DIN29_OUT_CONFREG __io_out_conf__(DIN29_BIT)
#define DIN29_IN_CONFREG __io_in_conf__(DIN29_BIT)
#define DIN29_OUTREG OUT0
#define DIN29_INREG IN0
#else
#define DIN29_OUTREG OUT1
#define DIN29_INREG IN1
#endif
#define DIO159 159
#define DIO159_BIT DIN29_BIT
#define DIO159_MUXREG DIN29_MUXREG
#define DIO159_OUT_CONFREG DIN29_OUT_CONFREG
#define DIO159_IN_CONFREG DIN29_IN_CONFREG
#define DIO159_OUTREG DIN29_OUTREG
#define DIO159_INREG DIN29_INREG
#endif
#if (defined(DIN30_BIT))
#define DIN30 160
#if (DIN30_BIT < 32)
#define DIN30_MUXREG __io_mux__(DIN30_BIT)
#define DIN30_OUT_CONFREG __io_out_conf__(DIN30_BIT)
#define DIN30_IN_CONFREG __io_in_conf__(DIN30_BIT)
#define DIN30_OUTREG OUT0
#define DIN30_INREG IN0
#else
#define DIN30_OUTREG OUT1
#define DIN30_INREG IN1
#endif
#define DIO160 160
#define DIO160_BIT DIN30_BIT
#define DIO160_MUXREG DIN30_MUXREG
#define DIO160_OUT_CONFREG DIN30_OUT_CONFREG
#define DIO160_IN_CONFREG DIN30_IN_CONFREG
#define DIO160_OUTREG DIN30_OUTREG
#define DIO160_INREG DIN30_INREG
#endif
